In [2]:
import pandas as pd
import sqlite3

In [3]:
query = """
CREATE TABLE test
(a VARCHAR(10),
b VARCHAR(10),
c REAL,
d INTEGER
);
"""

In [4]:
con = sqlite3.connect('examples/mydata.sqlite')

In [5]:
con.execute(query)

In [6]:
con.commit()

In [7]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [8]:
con.executemany(stmt, data)

In [9]:
con.commit()

In [10]:
cursor = con.execute('SELECT * FROM test')

In [11]:
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [12]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [14]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [15]:
import sqlalchemy as sqla

In [18]:
db = sqla.create_engine('sqlite:///examples/mydata.sqlite')

In [19]:
pd.read_sql('SELECT * FROM test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5